In [1]:
import sqlite3

In [2]:
conn = sqlite3.connect('sqlite_db_pythonsqlite.db')
cursor = conn.cursor()

In [3]:
cursor.execute('SELECT * FROM Facilities')
results = cursor.fetchall()
print(results)

[(0, 'Tennis Court 1', 5, 25, 10000, 200), (1, 'Tennis Court 2', 5, 25, 8000, 200), (2, 'Badminton Court', 0, 15.5, 4000, 50), (3, 'Table Tennis', 0, 5, 320, 10), (4, 'Massage Room 1', 9.9, 80, 4000, 3000), (5, 'Massage Room 2', 9.9, 80, 4000, 3000), (6, 'Squash Court', 3.5, 17.5, 5000, 80), (7, 'Snooker Table', 0, 5, 450, 15), (8, 'Pool Table', 0, 5, 400, 15)]

QUESTIONS

In [5]:
# Q1: Some of the facilities charge a fee to members, but some do not.
#Write a SQL query to produce a list of the names of the facilities that do. 

cursor.execute('SELECT DISTINCT(name),membercost FROM Facilities WHERE membercost NOT IN (0)')
results = cursor.fetchall()
print(results)

[('Tennis Court 1', 5), ('Tennis Court 2', 5), ('Massage Room 1', 9.9), ('Massage Room 2', 9.9), ('Squash Court', 3.5)]

In [6]:
# Q2: How many facilities do not charge a fee to members? */

cursor.execute('SELECT DISTINCT(name),membercost FROM Facilities WHERE membercost IN (0)')
results = cursor.fetchall()
print(results)

[('Badminton Court', 0), ('Table Tennis', 0), ('Snooker Table', 0), ('Pool Table', 0)]

In [7]:
# * Q3: Write an SQL query to show a list of facilities that charge a fee to members,
# where the fee is less than 20% of the facility's monthly maintenance cost.
# Return the facid, facility name, member cost, and monthly maintenance of the
# facilities in question.

cursor.execute('SELECT facid, name, membercost, monthlymaintenance FROM `Facilities` WHERE membercost < 0.2 *(monthlymaintenance) AND membercost NOT IN (0)')
results = cursor.fetchall()
print(results)

[(0, 'Tennis Court 1', 5, 200), (1, 'Tennis Court 2', 5, 200), (4, 'Massage Room 1', 9.9, 3000), (5, 'Massage Room 2', 9.9, 3000), (6, 'Squash Court', 3.5, 80)]

In [8]:
# Q4: Write an SQL query to retrieve the details of facilities with ID 1 and 5.
# Try writing the query without using the OR operator.

cursor.execute('SELECT * FROM `Facilities` WHERE facid IN (1,5)')
results = cursor.fetchall()
print(results)

[(1, 'Tennis Court 2', 5, 25, 8000, 200), (5, 'Massage Room 2', 9.9, 80, 4000, 3000)]

In [9]:
# Q5: Produce a list of facilities, with each labelled as
# 'cheap' or 'expensive', depending on if their monthly maintenance cost is
# more than $100. Return the name and monthly maintenance of the facilities
# in question.

cursor.execute('''
SELECT name, monthlymaintenance,
    CASE WHEN monthlymaintenance > 100 THEN 'Expensive'
    ELSE 'Cheap' END AS labelled
FROM Facilities
''')
results = cursor.fetchall()
print(results)

[('Tennis Court 1', 200, 'Expensive'), ('Tennis Court 2', 200, 'Expensive'), ('Badminton Court', 50, 'Cheap'), ('Table Tennis', 10, 'Cheap'), ('Massage Room 1', 3000, 'Expensive'), ('Massage Room 2', 3000, 'Expensive'), ('Squash Court', 80, 'Cheap'), ('Snooker Table', 15, 'Cheap'), ('Pool Table', 15, 'Cheap')]

In [10]:
#Q6: You'd like to get the first and last name of the last member(s)
#who signed up. Try not to use the LIMIT clause for your solution.

cursor.execute('SELECT firstname , surname, joindate AS joinlast FROM `Members` WHERE joindate =(SELECT MAX(`joindate`) FROM `Members`)')
results = cursor.fetchall()
print(results)

[('Darren', 'Smith', '2012-09-26 18:08:45')]

In [11]:
# Q7: Produce a list of all members who have used a tennis court.
# Include in your output the name of the court, and the name of the member
# formatted as a single column. Ensure no duplicate data, and order by
# the member name.

In [12]:
cursor.execute('''
SELECT DISTINCT CONCAT(firstname,' ',surname) AS full_name, f.name
FROM Members m
JOIN Bookings b ON b.memid = m.memid
JOIN Facilities f ON f.facid = b.facid
WHERE m.memid IN
(SELECT DISTINCT memid FROM `Bookings` WHERE f.facid IN (SELECT facid FROM `Facilities` WHERE `name` LIKE '%Tennis Court%'))
ORDER BY full_name
''')
results = cursor.fetchall()
print(results)

[('Anne Baker', 'Tennis Court 1'), ('Anne Baker', 'Tennis Court 2'), ('Burton Tracy', 'Tennis Court 2'), ('Burton Tracy', 'Tennis Court 1'), ('Charles Owen', 'Tennis Court 1'), ('Charles Owen', 'Tennis Court 2'), ('Darren Smith', 'Tennis Court 2'), ('David Farrell', 'Tennis Court 1'), ('David Farrell', 'Tennis Court 2'), ('David Jones', 'Tennis Court 2'), ('David Jones', 'Tennis Court 1'), ('David Pinker', 'Tennis Court 1'), ('Douglas Jones', 'Tennis Court 1'), ('Erica Crumpet', 'Tennis Court 1'), ('Florence Bader', 'Tennis Court 2'), ('Florence Bader', 'Tennis Court 1'), ('GUEST GUEST', 'Tennis Court 2'), ('GUEST GUEST', 'Tennis Court 1'), ('Gerald Butters', 'Tennis Court 1'), ('Gerald Butters', 'Tennis Court 2'), ('Henrietta Rumney', 'Tennis Court 2'), ('Jack Smith', 'Tennis Court 1'), ('Jack Smith', 'Tennis Court 2'), ('Janice Joplette', 'Tennis Court 1'), ('Janice Joplette', 'Tennis Court 2'), ('Jemima Farrell', 'Tennis Court 2'), ('Jemima Farrell', 'Tennis Court 1'), ('Joan Coplin', 'Tennis Court 1'), ('John Hunt', 'Tennis Court 1'), ('John Hunt', 'Tennis Court 2'), ('Matthew Genting', 'Tennis Court 1'), ('Millicent Purview', 'Tennis Court 2'), ('Nancy Dare', 'Tennis Court 2'), ('Nancy Dare', 'Tennis Court 1'), ('Ponder Stibbons', 'Tennis Court 2'), ('Ponder Stibbons', 'Tennis Court 1'), ('Ramnaresh Sarwin', 'Tennis Court 2'), ('Ramnaresh Sarwin', 'Tennis Court 1'), ('Tim Boothe', 'Tennis Court 2'), ('Tim Boothe', 'Tennis Court 1'), ('Tim Rownam', 'Tennis Court 2'), ('Tim Rownam', 'Tennis Court 1'), ('Timothy Baker', 'Tennis Court 2'), ('Timothy Baker', 'Tennis Court 1'), ('Tracy Smith', 'Tennis Court 1'), ('Tracy Smith', 'Tennis Court 2')]

In [14]:
#* Q8: Produce a list of bookings on the day of 2012-09-14 which
# will cost the member (or guest) more than $30. Remember that guests have
# different costs to members (the listed costs are per half-hour 'slot'), and
# the guest user's ID is always 0. Include in your output the name of the
# facility, the name of the member formatted as a single column, and the cost.
# Order by descending cost, and do not use any subqueries.

# Tennis Court, DArren Smith, 30.0 
#WITH daterange AS
#(SELECT * FROM `Bookings` WHERE `starttime`> '2012-09-14' AND `starttime`<= '2012-09-15')

cursor.execute('''

results = cursor.fetchall()
print(results)

[('Massage Room 1', 'GUEST GUEST', 9.9, 80), ('Massage Room 1', 'GUEST GUEST', 9.9, 80), ('Massage Room 1', 'GUEST GUEST', 9.9, 80), ('Massage Room 1', 'Burton Tracy', 9.9, 80), ('Massage Room 1', 'Ponder Stibbons', 9.9, 80), ('Massage Room 1', 'Jemima Farrell', 9.9, 80), ('Massage Room 1', 'Jemima Farrell', 9.9, 80), ('Massage Room 1', 'Jack Smith', 9.9, 80), ('Massage Room 1', 'Matthew Genting', 9.9, 80), ('Massage Room 2', 'GUEST GUEST', 9.9, 80), ('Massage Room 2', 'Florence Bader', 9.9, 80)]

In [15]:
# Q9: This time, produce the same result as in Q8, but using a subquery. */
cursor.execute('''
WITH daterange AS
(SELECT bookid, facid, memid, starttime FROM `Bookings` WHERE `starttime`> '2012-09-14' AND `starttime`<= '2012-09-15'),
mem_name AS
(SELECT CONCAT(firstname, ' ', surname) AS fullname, memid FROM Members) 

SELECT f.name,
    n.fullname,
    CASE WHEN f.guestcost > 30 THEN f.guestcost
        WHEN f.membercost > 30 THEN f.membercost
        ELSE 'member' END AS who
FROM Facilities AS f
LEFT JOIN daterange AS d
ON d.facid = f.facid
LEFT JOIN mem_name n ON n.memid = d.memid
WHERE f.membercost > 30 OR f.guestcost > 30
''')
results = cursor.fetchall()
print(results)

[('Massage Room 1', 'GUEST GUEST', 80), ('Massage Room 1', 'GUEST GUEST', 80), ('Massage Room 1', 'GUEST GUEST', 80), ('Massage Room 1', 'Burton Tracy', 80), ('Massage Room 1', 'Ponder Stibbons', 80), ('Massage Room 1', 'Jemima Farrell', 80), ('Massage Room 1', 'Jemima Farrell', 80), ('Massage Room 1', 'Jack Smith', 80), ('Massage Room 1', 'Matthew Genting', 80), ('Massage Room 2', 'GUEST GUEST', 80), ('Massage Room 2', 'Florence Bader', 80)]

PART 2: SQLite

Export the country club data from PHPMyAdmin, and connect to a local SQLite instance from Jupyter notebook 
for the following questions.

In [25]:
#QUESTIONS:
# Q10: Produce a list of facilities with a total revenue less than 1000.
#The output of facility name and total revenue, sorted by revenue. Remember
#that there's a different cost for guests and members! */

In [28]:
cursor.execute('''
SELECT name,  SUM(guestcost)+SUM(membercost) AS Total_Cost
FROM Facilities
GROUP BY name
HAVING  Total_Cost < 1000
ORDER BY Total_Cost
''')
results = cursor.fetchall()
print(results)

[('Pool Table', 5), ('Snooker Table', 5), ('Table Tennis', 5), ('Badminton Court', 15.5), ('Squash Court', 21.0), ('Tennis Court 1', 30), ('Tennis Court 2', 30), ('Massage Room 1', 89.9), ('Massage Room 2', 89.9)]

#/* Q11: Produce a report of members and who recommended them in alphabetic surname,firstname order */

In [34]:
cursor.execute('''
SELECT surname, firstname ,recommendedby
FROM Members
WHERE recommendedby != ''
''')
results = cursor.fetchall()
print(results)

[('Joplette', 'Janice', '1'), ('Butters', 'Gerald', '1'), ('Dare', 'Nancy', '4'), ('Boothe', 'Tim', '3'), ('Stibbons', 'Ponder', '6'), ('Owen', 'Charles', '1'), ('Jones', 'David', '4'), ('Baker', 'Anne', '9'), ('Smith', 'Jack', '1'), ('Bader', 'Florence', '9'), ('Baker', 'Timothy', '13'), ('Pinker', 'David', '13'), ('Genting', 'Matthew', '5'), ('Mackenzie', 'Anna', '1'), ('Coplin', 'Joan', '16'), ('Sarwin', 'Ramnaresh', '15'), ('Jones', 'Douglas', '11'), ('Rumney', 'Henrietta', '20'), ('Worthington-Smyth', 'Henry', '2'), ('Purview', 'Millicent', '2'), ('Hunt', 'John', '30'), ('Crumpet', 'Erica', '2')]

In [ ]:
#/* Q12: Find the facilities with their usage by member, but not guests */

In [48]:
cursor.execute('''
SELECT f.name, memid
FROM Bookings b
LEFT JOIN Facilities f ON b.facid = f.facid
WHERE memid != 0
GROUP BY b.facid
''')
result = cursor.fetchall()
print(result)

[('Tennis Court 1', 2), ('Tennis Court 2', 3), ('Badminton Court', 1), ('Table Tennis', 1), ('Massage Room 1', 1), ('Massage Room 2', 4), ('Squash Court', 1), ('Snooker Table', 1), ('Pool Table', 1)]

In [ ]:
#/* Q13: Find the facilities usage by month, but not guests */

In [59]:
cursor.execute('''
SELECT COUNT(b.memid),f.name,STRFTIME('%Y-%m',starttime) AS year_month
FROM Bookings b
LEFT JOIN Facilities f ON b.facid = f.facid
WHERE memid!=0
GROUP BY year_month, f.name
ORDER BY year_month
''')
result = cursor.fetchall()
print(result)

[(51, 'Badminton Court', '2012-07'), (77, 'Massage Room 1', '2012-07'), (4, 'Massage Room 2', '2012-07'), (103, 'Pool Table', '2012-07'), (68, 'Snooker Table', '2012-07'), (23, 'Squash Court', '2012-07'), (48, 'Table Tennis', '2012-07'), (65, 'Tennis Court 1', '2012-07'), (41, 'Tennis Court 2', '2012-07'), (132, 'Badminton Court', '2012-08'), (153, 'Massage Room 1', '2012-08'), (9, 'Massage Room 2', '2012-08'), (272, 'Pool Table', '2012-08'), (154, 'Snooker Table', '2012-08'), (85, 'Squash Court', '2012-08'), (143, 'Table Tennis', '2012-08'), (111, 'Tennis Court 1', '2012-08'), (109, 'Tennis Court 2', '2012-08'), (161, 'Badminton Court', '2012-09'), (191, 'Massage Room 1', '2012-09'), (14, 'Massage Room 2', '2012-09'), (408, 'Pool Table', '2012-09'), (199, 'Snooker Table', '2012-09'), (87, 'Squash Court', '2012-09'), (194, 'Table Tennis', '2012-09'), (132, 'Tennis Court 1', '2012-09'), (126, 'Tennis Court 2', '2012-09')]